perf/scenarios/space_news_endurance.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api.space_news"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp up load
      duration: 60
      arrivalRate: 50
      rampTo: 200
    - name: Plain load
      duration: 120
      arrivalRate: 200

scenarios:
  - name: Space News Endurance
    flow:
      - get:
          url: "/space_news"