perf/scenarios/space_news_load.yaml
config:
  environments:
    api:
      target: "http://localhost:5555/api"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp up load
      duration: 30
      arrivalRate: 60
      rampTo: 80
    - name: Plain load
      duration: 30
      arrivalRate: 80
    - name: Ramp up load 2
      duration: 30
      arrivalRate: 80
      rampTo: 100
    - name: Plain load 2
      duration: 60
      arrivalRate: 100
    # Hasta aca bien, luego del rampup empiezo a tener 500s
    - name: Ramp up load 3
      duration: 30
      arrivalRate: 100
      rampTo: 120
    # Empiezan los 500s
    - name: Plain load 3
      duration: 60
      arrivalRate: 120
    - name: Load Spike
      duration: 60
      arrivalRate: 150

scenarios:
  - name: Space News Load
    flow:
      - get:
          url: "/space_news"